gaetangaetan/ESP32-D1-MINI-DMX-SENDER/src/main.cpp

#define VERSION 160
/*
// Contrôleur interactif ESP32 avec capteurs Sharp IR
// Utilise ESP-NOW pour transmettre les données DMX
// Fréquence d'émission : 50Hz
// Canal DMX 102 : valeur du capteur Sharp IR (0-255)
*/

#include <Arduino.h>
#include <esp_now.h>
#include <WiFi.h>
#include <ESP32Encoder.h>
#include <Wire.h>
#include <TM1637.h>
#include <driver/adc.h>  // Pour les constantes ADC de l'ESP32
#include <FastLED.h>     // Pour le ruban WS2812B

#define CONTROL_TEST 0 // 1 pour tester les entrées, 0 pour le fonctionnement normal

// Définitions pour les capteurs Sharp IR
#define DIST_SENSOR_1_PIN 35    // GPIO35 - Premier capteur Sharp IR (changé pour plus de stabilité)
#define DIST_SENSOR_2_PIN 36    // GPIO36 - Deuxième capteur Sharp IR

// Définitions pour les faders analogiques
#define FADER_1_PIN 32    // GPIO32 - Premier fader
#define FADER_2_PIN 33    // GPIO33 - Deuxième fader (changé pour éviter le conflit)
#define FADER_3_PIN 34    // GPIO34 - Troisième fader

// Définitions pour l'encodeur rotatif KY-040
#define ENCODER_A_PIN 26    // GPIO26 - Pin A de l'encodeur
#define ENCODER_B_PIN 27    // GPIO27 - Pin B de l'encodeur
#define ENCODER_BUTTON_PIN 25  // GPIO25 - Bouton de l'encodeur

// Définitions pour l'afficheur TM1637
#define TM1637_CLK_PIN 18    // GPIO18 - CLK de l'afficheur
#define TM1637_DIO_PIN 19    // GPIO19 - DIO de l'afficheur

// Définitions pour les boutons push (remplacement du PCF8574)
#define BUTTON_1_PIN 22    // GPIO22 - Premier bouton (libéré du PCF8574)
#define BUTTON_2_PIN 21    // GPIO21 - Deuxième bouton (libéré du PCF8574)
#define BUTTON_3_PIN 23    // GPIO23 - Troisième bouton (nouveau GPIO)

// Définitions pour le ruban WS2812B
#define LED_STRIP_PIN 4    // GPIO4 - Signal DATA du WS2812B
#define NUM_LEDS 8         // Nombre de LEDs dans le ruban (ajustable)
#define BRIGHTNESS 64      // Luminosité (0-255)

// Configuration ESP-NOW
#define EMISSION_FREQUENCY 50  // Hz (20ms entre chaque émission)
#define DMX_CHANNEL_IR_1 102  // Canal DMX pour le premier capteur Sharp IR
#define DMX_CHANNEL_IR_2 103  // Canal DMX pour le deuxième capteur Sharp IR
#define MAX_DISTANCE_CM 80  // Distance maximale en cm pour Sharp IR (80cm = 0, 4cm = 255)
#define MIN_DISTANCE_CM 4   // Distance minimale en cm pour Sharp IR

// Configuration des presets
#define PRESET_SIZE 24  // Nombre de paramètres par preset (24 au lieu de 20)
#define MAX_PRESETS 10  // Nombre maximum de presets

// Structure pour un paramètre
typedef struct {
  const char* name;     // Nom du paramètre
  uint16_t dmxChannel;  // Canal DMX (1-512)
  uint8_t value;        // Valeur actuelle (0-255)
  uint8_t defaultValue; // Valeur par défaut
} Parameter;

// Structure pour un preset complet
typedef struct {
  char name[16];        // Nom du preset
  uint8_t values[PRESET_SIZE]; // Valeurs des paramètres
} Preset;

// Création des objets
TM1637 display(TM1637_CLK_PIN, TM1637_DIO_PIN);
ESP32Encoder encoder;

// Définition du tableau de LEDs pour FastLED
CRGB leds[NUM_LEDS];

// Définition des 24 paramètres du theremin selon la liste fournie
Parameter parameters[PRESET_SIZE] = {
  {"autopan_depth", 101, 0, 0},
  {"pitch", 102, 0, 0},
  {"vibrato_speed", 103, 0, 0},
  {"vibrato_depth", 104, 0, 0},
  {"delay_time", 105, 0, 0},
  {"delay_feedback", 106, 0, 0},
  {"osc_waveform", 107, 0, 0},
  {"gate_threshold", 108, 0, 0},
  {"portamento_time", 109, 0, 0},
  {"scale", 110, 0, 0},
  {"octave_low_high", 111, 0, 0},
  {"osc2_volume", 112, 0, 0},
  {"osc2_pitch_offset", 113, 0, 0},
  {"autopan_frequency", 114, 0, 0},
  {"scale_tonic", 115, 0, 0},
  {"volume_drums", 116, 0, 0},
  {"trig_kick", 117, 0, 0},
  {"trig_snare", 118, 0, 0},
  {"trig_hh", 119, 0, 0},
  {"master_volume", 120, 0, 0},
  {"filter_on_off", 121, 0, 0},
  {"filter_cutoff", 122, 0, 0},
  {"filter_reso", 123, 0, 0},
  {"filter_type", 124, 0, 0}
};

// Tableau des presets
Preset presets[MAX_PRESETS];

// Tableau des valeurs DMX (512 canaux)
uint8_t dmxValues[512];

// Structure pour les paquets DMX
typedef struct struct_dmx_packet
{
  uint8_t blockNumber; // on divise les 512 adresses en 4 blocs de 128 adresses
  uint8_t dmxvalues[128];
} struct_dmx_packet;

// Structure pour les données de retour du Ksoloti
typedef struct struct_ksoloti_feedback
{
  uint8_t startByte;    // 0xCC pour identifier les paquets de retour
  uint8_t val1;         // Première valeur du Ksoloti
  uint8_t val2;         // Deuxième valeur du Ksoloti
  uint8_t checksum;     // Checksum pour validation
} struct_ksoloti_feedback;

struct_dmx_packet outgoingDMXPacket;
struct_ksoloti_feedback incomingKsolotiData;

// Adresse de diffusion ESP-NOW
uint8_t broadcastAddress[] = {0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF};

// Variables pour stocker les données reçues du Ksoloti
uint8_t ksoloti_val1 = 0;
uint8_t ksoloti_val2 = 0;
bool ksoloti_data_updated = false;

esp_now_peer_info_t peerInfo;

// Variables de timing
unsigned long lastEmissionTime = 0;
const unsigned long EMISSION_INTERVAL = 1000 / EMISSION_FREQUENCY; // 20ms pour 50Hz

// Variables pour les boutons PCF8574
bool buttonStates[3] = {false, false, false};
bool lastButtonStates[3] = {false, false, false};
unsigned long lastButtonPress[3] = {0, 0, 0};
const unsigned long BUTTON_DEBOUNCE = 200; // 200ms de debounce

// Variables pour les faders
uint8_t faderValues[3] = {0, 0, 0};
uint8_t lastFaderValues[3] = {0, 0, 0};

// Variables pour l'encodeur
int32_t lastEncoderValue = 0;
uint8_t selectedPreset = 1;  // Index du preset sélectionné (0-9)
bool encoderButtonPressed = false;
unsigned long lastEncoderButtonPress = 0;

// Variables pour l'affichage
unsigned long lastDisplayUpdate = 0;
const unsigned long DISPLAY_UPDATE_INTERVAL = 100; // 100ms entre les mises à jour

// Variable pour le compteur d'affichage
uint16_t displayCounter = 0;

// Variables pour la stabilisation des capteurs IR - VERSION SIMPLIFIÉE
#define IR_SAMPLE_SIZE 10        // Taille de la moyenne mobile (ajustable)
#define IR_MAX_DEVIATION 50      // Limite des écarts autorisés (ajustable)

int irBuffer1[IR_SAMPLE_SIZE];   // Buffer pour IR1
int irBuffer2[IR_SAMPLE_SIZE];   // Buffer pour IR2
int irIndex1 = 0;                // Index circulaire IR1
int irIndex2 = 0;                // Index circulaire IR2
int irSum1 = 0;                  // Somme IR1
int irSum2 = 0;                  // Somme IR2
bool irInitialized1 = false;     // Initialisation IR1
bool irInitialized2 = false;     // Initialisation IR2

// Fonction pour stabiliser un capteur IR avec moyenne mobile et limitation d'aberrants
int stabilizeIRSensor(int newValue, int* buffer, int& index, int& sum, bool& initialized) {
  // Initialisation : remplir le buffer avec la première valeur
  if (!initialized) {
    for (int i = 0; i < IR_SAMPLE_SIZE; i++) {
      buffer[i] = newValue;
    }
    sum = newValue * IR_SAMPLE_SIZE;
    initialized = true;
  }
  
