gaetangaetan/ESP32-D1-MINI-DMX-SENDER/src/main.cpp
  // Preset 6 - À définir
  setAllParameters(0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0);
  savePreset(6, "Preset6");
  
  // Preset 7 - À définir
  setAllParameters(0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0);
  savePreset(7, "Preset7");
  
  // Preset 8 - À définir
  setAllParameters(0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0);
  savePreset(8, "Preset8");
  
  // Preset 9 - À définir
  setAllParameters(0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0);
  savePreset(9, "Preset9");
  
  Serial.println("Presets initialisés");
}

// Fonction d'initialisation de l'interface utilisateur
void initializeUserInterface() {
 
  // Configuration des boutons push
  pinMode(BUTTON_1_PIN, INPUT_PULLUP);
  pinMode(BUTTON_2_PIN, INPUT_PULLUP);
  pinMode(BUTTON_3_PIN, INPUT_PULLUP);
  
  // Initialisation du ruban WS2812B
  FastLED.addLeds<WS2812B, LED_STRIP_PIN, GRB>(leds, NUM_LEDS);
  FastLED.setBrightness(BRIGHTNESS);
  FastLED.clear();
  FastLED.show();
  
  // Initialisation de l'encodeur KY-040
  encoder.attachHalfQuad(ENCODER_A_PIN, ENCODER_B_PIN);
  encoder.setCount(0);
  pinMode(ENCODER_BUTTON_PIN, INPUT_PULLUP);
  
  // Initialisation de l'afficheur TM1637
  display.init();
  display.setBrightness(7); // 0-7
  display.clearScreen();
 
    // Configuration ADC pour une meilleure résolution
    analogReadResolution(12); // 12 bits (0-4095)

  Serial.println("Interface utilisateur initialisée");
}

// Fonction pour lire les capteurs Sharp IR avec stabilisation - NOUVELLE STRATÉGIE
void readSharpIRSensors() {
  // Lecture stabilisée du premier capteur Sharp IR
  int stabilizedValue1 = readStabilizedIRSensor(DIST_SENSOR_1_PIN, irBuffer1, irIndex1, irSum1, irInitialized1);
  uint8_t sharpIRValue1 = stabilizedValue1 / 16;
  setParameter("pitch", sharpIRValue1);
  
  // Lecture stabilisée du deuxième capteur Sharp IR
  int stabilizedValue2 = readStabilizedIRSensor(DIST_SENSOR_2_PIN, irBuffer2, irIndex2, irSum2, irInitialized2);
  uint8_t sharpIRValue2 = stabilizedValue2 / 16;
  setParameter("vibrato_speed", sharpIRValue2);
  
  // Debug minimal
  Serial.print("IR1: ");
  Serial.print(stabilizedValue1);
  Serial.print(" -> ");
  Serial.print(sharpIRValue1);
  Serial.print(" | IR2: ");
  Serial.print(stabilizedValue2);
  Serial.print(" -> ");
  Serial.println(sharpIRValue2);
}

// Fonction pour lire les faders
void readFaders() {
  faderValues[0] = analogRead(FADER_1_PIN) / 16; // 0-4095 -> 0-255
  faderValues[1] = analogRead(FADER_2_PIN) / 16;
  faderValues[2] = analogRead(FADER_3_PIN) / 16;
  
  // Mise à jour des paramètres selon les faders
  if (faderValues[0] != lastFaderValues[0]) {
    setParameter("filter_cutoff", faderValues[0]);
    lastFaderValues[0] = faderValues[0];
  }
  
  if (faderValues[1] != lastFaderValues[1]) {
    setParameter("filter_reso", faderValues[1]);
    lastFaderValues[1] = faderValues[1];
  }
  
  if (faderValues[2] != lastFaderValues[2]) {
    setParameter("delay_time", faderValues[2]);
    lastFaderValues[2] = faderValues[2];
  }
}

// Fonction pour gérer les boutons push
void handleButtons() {
  // Lecture des boutons
  bool button1State = !digitalRead(BUTTON_1_PIN); // Inversé car INPUT_PULLUP
  bool button2State = !digitalRead(BUTTON_2_PIN);
  bool button3State = !digitalRead(BUTTON_3_PIN);
  
  // Bouton 1 - Charger preset 0
  if (button1State && !lastButtonStates[0] && (millis() - lastButtonPress[0] > BUTTON_DEBOUNCE)) {
    loadPreset(0);
    Serial.println("Bouton 1 - Preset 0 chargé");
    lastButtonPress[0] = millis();
  }
  lastButtonStates[0] = button1State;
  
  // Bouton 2 - Charger preset 1
  if (button2State && !lastButtonStates[1] && (millis() - lastButtonPress[1] > BUTTON_DEBOUNCE)) {
    loadPreset(1);
    Serial.println("Bouton 2 - Preset 1 chargé");
    lastButtonPress[1] = millis();
  }
  lastButtonStates[1] = button2State;
  
  // Bouton 3 - Charger preset 2
  if (button3State && !lastButtonStates[2] && (millis() - lastButtonPress[2] > BUTTON_DEBOUNCE)) {
    loadPreset(2);
    Serial.println("Bouton 3 - Preset 2 chargé");
    lastButtonPress[2] = millis();
  }
  lastButtonStates[2] = button3State;
}

// Fonction pour gérer l'encodeur KY-040
void handleEncoder() {
  int32_t currentEncoderValue = - encoder.getCount();
  Serial.print("currentEncoderValue: ");
  Serial.print(currentEncoderValue);
  
  // Calculer le preset selon la formule : |valeur_encoder / 2| % 10
  // Utiliser la valeur absolue pour éviter les problèmes avec les grandes valeurs négatives
  int32_t normalizedValue = abs(currentEncoderValue / 2);
  uint8_t newPreset = normalizedValue % MAX_PRESETS;
  Serial.print(" - newPreset: ");
  Serial.println(newPreset);
  
  // Si le preset a changé
  if (newPreset != selectedPreset) {
    selectedPreset = newPreset;
    
    // Charger le preset sélectionné
    loadPreset(selectedPreset);
    
    // Afficher le numéro du preset sur le display (aligné à droite)
    display.clearScreen();
    //display.display(selectedPreset,true,true,3);
    display.display(selectedPreset);
    /*
    Serial.print("Preset changé: ");
    Serial.print(selectedPreset);
    Serial.print(" - ");
    Serial.println(presets[selectedPreset].name);
    */
  }
  
  // Gestion du bouton de l'encodeur (toggle filtre)
  bool encoderButtonState = !digitalRead(ENCODER_BUTTON_PIN);
  if (encoderButtonState && !encoderButtonPressed && (millis() - lastEncoderButtonPress > BUTTON_DEBOUNCE)) {
    uint8_t currentFilterState = getParameter("filter_on_off");
    uint8_t newFilterState = (currentFilterState == 0) ? 255 : 0;
    setParameter("filter_on_off", newFilterState);
    
    Serial.print("Filtre: ");
    Serial.println((newFilterState == 255) ? "ON" : "OFF");
    
    encoderButtonPressed = true;
    lastEncoderButtonPress = millis();
  }
  
  if (!encoderButtonState) {
    encoderButtonPressed = false;
  }
}

// Fonction pour mettre à jour l'afficheur TM1637
void updateDisplay() {
  if (millis() - lastDisplayUpdate >= DISPLAY_UPDATE_INTERVAL) {
    // Afficher le preset sélectionné
    display.display(selectedPreset);
    
